### OpenTofu Plan

<details>
<summary>Plan output</summary>

```
data.cloudflare_zone.zone: Reading...
cloudflare_pages_project.preview: Refreshing state... [id=andy-apps-preview]
cloudflare_pages_project.project["clock"]: Refreshing state... [id=andy-apps-clock]
cloudflare_pages_project.project["homepage"]: Refreshing state... [id=andy-apps-homepage]
data.cloudflare_zone.zone: Read complete after 0s [id=a7f7a62f2c2b914baa9b82b9e41a29c5]
cloudflare_pages_domain.domain["homepage"]: Refreshing state... [id=2c55d7af-683f-4463-aa98-5bc7b1e707cd]
cloudflare_pages_domain.domain["clock"]: Refreshing state... [id=74b72e0f-818d-420e-859a-f0437bd35828]
cloudflare_record.cname["homepage"]: Refreshing state... [id=c2155ce7863f7e7689dc3f05367746e2]
cloudflare_record.cname["clock"]: Refreshing state... [id=d0e16b835decb7bb06f5feb0736801e3]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # cloudflare_pages_domain.domain["weft"] will be created
  + resource "cloudflare_pages_domain" "domain" {
      + account_id   = "6050946b66172190524579962c958e5a"
      + domain       = "weft.apps.andymolenda.com"
      + id           = (known after apply)
      + project_name = "andy-apps-weft"
      + status       = (known after apply)
    }

  # cloudflare_pages_project.project["weft"] will be created
  + resource "cloudflare_pages_project" "project" {
      + account_id        = "6050946b66172190524579962c958e5a"
      + created_on        = (known after apply)
      + domains           = (known after apply)
      + id                = (known after apply)
      + name              = "andy-apps-weft"
      + production_branch = "main"
      + subdomain         = (known after apply)
    }

  # cloudflare_record.cname["weft"] will be created
  + resource "cloudflare_record" "cname" {
      + allow_overwrite = true
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "weft.apps"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "a7f7a62f2c2b914baa9b82b9e41a29c5"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ project_urls = {
      + weft     = "https://weft.apps.andymolenda.com"
        # (2 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "tfplan"
```

</details>